from PIL import Image
def description():
    print('''注意:
        如果图片跟此软件在同一目录下,那么可以直接写图片名
    图片的绝对路径:指的完整的路径,比方说: D\图片文件夹名\图片名.jpg
        保存的文本名,需要把后缀也加上,eg: 123.txt
    保存位置默认是当前文件夹下,如果需要指定,可以写上完整路径+保存的名字
        另外,选取的图片也不要太大,否则即便是转换了,也不能在文本中完整看到
        查看方法:使用记事本打开,按住CTRL键不松手,然后用鼠标滚轮将文本内容缩小即可
    q:退出
    ''')
def file_pic():
    while 1:
        jpg1 = input("<请输入图片的绝对路径及图片名>:")
        if jpg1.lower().strip() == "q":
            break
        else:
            text2 = input("<请输入保存的文本名>:")
            if text2.lower().strip() == "q":
                break
            else:
                tran(jpg1,text2)

def tran(jpg1,txt2):
    try:
        img = Image.open(f"{jpg1}".format(jpg1))
        # 先打开图片
        #现将图片改为灰度模式
        out = img.convert("L")
        #查看灰度模式的图
        # out.show()
        #计算图片的长度和宽度
        # print(out.size)   #(1908, 3392)
        #重新对长宽进行赋值
        width,height = out.size
        #传入参数是个二元组,必须是int类型,一般都乘一样的话,图片会被拉长,所以把宽度调低点(一般转换后的宽度是长度的二倍,所以修改时要取半)
        out = out.resize((int(width),int(height * 0.5)))
        # out = out.resize((int(width * 0.1*0.5),int(height*0.1*0.5*0.5)))
        width,height = out.size
        #获取图片中指定位置的像素值,0是黑色,255是白色
        # print(out.getpixel((100,100)))
        #根据体积的不同来设定一串字符串,让不同像素的来取不同的值,来实现变成字符画
        asciis = "@%#*+=-. "
        #定义个空字符串来接收字符画的值
        texts = ""
        #将原图片的各个位置分别取对应像素的字符asciis值
        for row in range(height):
            for col in range(width):
                #上面这是取坐标
                gray = out.getpixel((col,row))
                #根据像素取自定义编码的值,8是因为索引到8,共9个字符
                texts += asciis[int(gray / 255 * 8)]
            texts += "\n"
        with open(f"{txt2}","w") as file:
            file.write(texts)
        print("====================转换完成============================"


              )
    except:
        print("输入的内容有错误,请重新输入")

def banners():
    banner = '''
                                        ######              
            ######                    ##########            
          ######################################            
        ##::########::::::::::::::::::::##########          
      ##::::::########::::::::::::##::::::::########        
      ##::::::######::::::::::::::::##::::::::######        
    ##::::::######::::::::::::::::::::::::::::::####        
    ##::::::::##::::::::::::::::::::::::::::::::::##        
  ##::::::####::::::##::::::::::::::##::::::::  ::##        
  ##::::::##::::::##::::::::::::::::##::      ::::::##      
  ##::::::##::::::##::      ::    ##  ##::::::::::::##      
##::::::::##::::::##::::::::##::::##  ####::::##::::##      
##::::::::##::::##::::::::##::::##      ##::::::##::##      
##::::::::##::::##::::::##::::::##    ######::::####        
##::::::::##::####::::##########      ##  ##::::####        
##::::::::##::########  ####  ##      ##  ##::::##          
##::::::::##########::    ##          ::  ##::########  ##  
##::::::::####::####::  ##::          ##  ##::####  ####  ##
##::::::::##  ######::  ####              ####::##  ##    ##
##::::::::##    ##::::          ##       ####::::##      ## 
##::::::::##      ####::            ######::::::##    ##    
##::::::::::##        ############::##  ##::::##    ##      
##::::::::::##      ##    ########::####::####    ##        
##::::::::::##    ##::::##########::########    ####        
##::::::::::##  ########::::####::##::####    ##::::##      
##::::::::::::##############::::######::##  ##::::::##      
  ##::::::::::####  ########################::::::::##      
  ##::::::::::##  ####::::::::::::::::::####::::::::##      
    ##::::::::##      ##################    ##::::##        
      ##::::##      ########      ##::##      ####          
        ####        ##::##          ####                    
                      ##                                                                        

                                            version:图片转字符画1.0
                                            author:邪王真视守卫
 '''
    print(banner)
    description()

if __name__ == '__main__':
    banners()
    file_pic()
